#ifndef DIPLOMA_KEY_SERVER_H
#define DIPLOMA_KEY_SERVER_H

#include "common_args.h"

/* ----------------------------------------------------------------------------------------------- */
/*! Структура заголовка сообщений ключевого сервера  */
/* ----------------------------------------------------------------------------------------------- */
typedef struct mka_ksmsg {
//    int sak_len;
    int reply_flg;
} mka_ksmsg;

/* ----------------------------------------------------------------------------------------------- */
/*! Ф-ия, передаваемая в поток отправки ключей

    @param args - mka_common_args - структура с общими параметрами

*/
/* ----------------------------------------------------------------------------------------------- */
void *mka_ksmsg_send_thread_func(void *args);

/* ----------------------------------------------------------------------------------------------- */
/*! Ф-ия отправки SAK на все интерфейсы

    @param commonArgs               - структура с общими параметрами
    @param ignored_interface_num    - номер интерфейса, на который не нужно посылать ключ (например, если
                                      на этот интерфейс пришел сам ключ)
    @param ignored_alive_p_num      - номер узла, на который не нужно посылать ключ (например, от
                                      этого узла пришел сам ключ)
*/
/* ----------------------------------------------------------------------------------------------- */
void mka_ksmsg_send_sak_2_all(mka_common_args *commonArgs, int ignored_interface_num, int ignored_alive_p_num);

/* ----------------------------------------------------------------------------------------------- */
/*! Ф-ия отправки SAK

    @param commonArgs               - структура с общими параметрами
    @param interface_num            - номер интерфейса, на который нужно посылать ключ
    @param peer_id                  - номер узла, которому нужно посылать ключ
*/
/* ----------------------------------------------------------------------------------------------- */
void mka_ksmsg_reply_sak(mka_common_args *commonArgs, int interface_num, int peer_id);

/* ----------------------------------------------------------------------------------------------- */
/*! Ф-ия отправки запроса на повтороную отправку SAK

    @param commonArgs               - структура с общими параметрами

*/
/* ----------------------------------------------------------------------------------------------- */
void mka_ksmsg_send_reply(mka_common_args *commonArgs);

#endif //DIPLOMA_KEY_SERVER_H
