#ifndef DIPLOMA_KEY_SERVER_H
#define DIPLOMA_KEY_SERVER_H

#include "common_args.h"

/* ----------------------------------------------------------------------------------------------- */
/*! Структура заголовка сообщений ключевого сервера  */
/* ----------------------------------------------------------------------------------------------- */
typedef struct mka_ksmsg {
//    int sak_len;
} mka_ksmsg;

/* ----------------------------------------------------------------------------------------------- */
/*! Ф-ия, передаваемая в поток отправки ключей

    @param args - mka_common_args - структура с общими параметрами

*/
/* ----------------------------------------------------------------------------------------------- */
void *mka_ksmsg_send_thread_func(void *args);

/* ----------------------------------------------------------------------------------------------- */
/*! Ф-ия отправки SAK

    @param commonArgs               - структура с общими параметрами
    @param ignored_interface_num    - номер интерфейса, на который не нужно посылать ключ (например, если
                                      на этот интерфейс пришел сам ключ)
*/
/* ----------------------------------------------------------------------------------------------- */
void mka_ksmsg_send_sak(mka_common_args *commonArgs, int ignored_interface_num);


#endif //DIPLOMA_KEY_SERVER_H
