#ifndef DIPLOMA_OTHER_FUNCTIONS_H
#define DIPLOMA_OTHER_FUNCTIONS_H

#include <stdio.h>
#include "libakrypt.h"

/* ----------------------------------------------------------------------------------------------- */
/*! Вывод на экран строки в hex

    @param str      - указатель на строку
    @param str_len  - длина строки

*/
/* ----------------------------------------------------------------------------------------------- */
void print_string(char *str, int str_len);

/* ----------------------------------------------------------------------------------------------- */
/*! Выработка псевдо случайной строки

    @param rand_len - длина строки

    @return указатель на строку
*/
/* ----------------------------------------------------------------------------------------------- */
char *generate_rnd_string(int rand_len);

#endif //DIPLOMA_OTHER_FUNCTIONS_H
